#include<stdio.h>
void main(void)
{
	printf("%50s", "Первое задание\n");
	printf("%20s\n", "Это текст");
	printf("\t%-20s\n", "Это текст");
	printf("%10.3f\n", 12.234657);
	printf("%10.5f\n", 12.234657);
	printf("Остаток от деления %d на %d равен %d\n ", 5, 2, 5 % 2);
	printf("Остаток от деления %d на %d равен %d\n ", 7, 5, 7 % 5);
	printf("Умножение %d на %d равено %d\n ", 2000, 4, 2000 * 4);
	printf("%g разделить %e равно %f\n ", 5., 2., 5. / 2);
	printf("%d разделить %d равно %d\n ", 5., 2., 5. / 2);
	printf("%f разделить %f равно %f\n ", 5., 2., 5. / 2);
	printf("%g разделить %g равно %g\n ", 5., 2., 5. / 2);
	printf("%e разделить %e равно %e\n ", 5., 2., 5. / 2);
	printf("%50s", "Ворое задание\n");
	int n = 7, k = 35;
	printf("Сейчас %d часов %d минут 00 секунд\n", n, k);
	printf("Идет %d минута суток\n", n * 60 + k);
	printf("До полуночи осталось %d часов и %d минут\n", 24 - n, 60 - k);
	printf("С 8.00 прошло %d секунд\n", n);
	printf("Текущий час = %d /24 суток  и текущая минута = %d /60 часа\n", n, k);;
	int N = 2, K = 3, M = 7;
	printf("Задание 3. Напишите программу деления числа %d  на 333  с использованием одной функции printf и выведите результат в формате %d цифр целой части и %d – дробной.\n", N, K, M);
	printf("%.7f", N / 333);
}